rails_app/app/controllers/authentications_controller.rb

  def index
    @authentications = Authentication.all
---
SELECT "authentications".* FROM "authentications"

  def show
    @authentication = Authentication.find(params[:id])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @authentication = Authentication.find(params[:id])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    auth = request.env["omniauth.auth"]
    Authentication.find_or_create_by_provider_and_uid(user: current_user.id,provider: auth['provider'], uid: auth['uid'])
---
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 21:53:35 UTC +00:00], ["provider", "twitter"], ["uid", "191465959"], ["updated_at", Wed, 18 Sep 2013 21:53:35 UTC +00:00], ["user_id", 1]]
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'twitter' AND "authentications"."uid" = '191465959' LIMIT 1

  def update
    @authentication = Authentication.find(params[:id])

    respond_to do |format|
      if @authentication.update_attributes(params[:authentication])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "authentications" SET "user_id" = 3, "updated_at" = '2013-09-26 15:06:57.967229' WHERE "authentications"."id" = 2

  def destroy
    @authentication = Authentication.find(params[:id])
    @authentication.destroy
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "authentications" WHERE "authentications"."id" = ?  [["id", 1]]