rails_app/app/controllers/homes_controller.rb

  def index
    @authentication = Authentication.where(:user_id => current_user.id)
    if @authentication.count <= 0
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 3
SELECT COUNT(*) FROM "authentications" WHERE "authentications"."user_id" = 2

  def load_tweets
    @authentications = Authentication.all
---
SELECT "authentications".* FROM "authentications"

  def admin_user
    arr = Array.new()

    User.all.each do |user|
      temp_arr = Array.new()
      exits = Authentication.where(:user_id => user.id)
      value = (exits.count <=  0)? "": Authentication.find(user.id)
---
SELECT "users".* FROM "users"
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" IN (1, 2)
SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "authentications" WHERE "authentications"."user_id" = 1

   def destroy_user
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]